Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputs_ (InputLayer)         [(None, 6986636)]         0         
_________________________________________________________________
reshape (Reshape)            (None, 6986636, 1)        0         
_________________________________________________________________
gene_layer (LocallyDirected1 (None, 21476, 1)          6668279   
_________________________________________________________________
flatten (Flatten)            (None, 21476)             0         
_________________________________________________________________
activation (Activation)      (None, 21476)             0         
_________________________________________________________________
inter_out (BatchNormalizatio (None, 21476)             42952     
_________________________________________________________________
dense (Dense)                (None, 1)                 21477     
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 6,732,708
Trainable params: 6,689,756
Non-trainable params: 42,952
_________________________________________________________________
