Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputs_ (InputLayer)         [(None, 6986636)]         0         
_________________________________________________________________
reshape (Reshape)            (None, 6986636, 1)        0         
_________________________________________________________________
gene_layer (LocallyDirected1 (None, 21476, 1)          6668279   
_________________________________________________________________
activation (Activation)      (None, 21476, 1)          0         
_________________________________________________________________
inter_out0 (BatchNormalizati (None, 21476, 1)          2         
_________________________________________________________________
gtex_layer (LocallyDirected1 (None, 53, 1)             80249     
_________________________________________________________________
activation_1 (Activation)    (None, 53, 1)             0         
_________________________________________________________________
inter_out1 (BatchNormalizati (None, 53, 1)             2         
_________________________________________________________________
flatten (Flatten)            (None, 53)                0         
_________________________________________________________________
dense_layer (Dense)          (None, 1)                 54        
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 6,748,586
Trainable params: 6,748,582
Non-trainable params: 4
_________________________________________________________________
