Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputs_ (InputLayer)         [(None, 6986636)]         0         
_________________________________________________________________
reshape (Reshape)            (None, 6986636, 1)        0         
_________________________________________________________________
gene_layer (LocallyDirected1 (None, 15827, 1)          6661236   
_________________________________________________________________
flatten (Flatten)            (None, 15827)             0         
_________________________________________________________________
activation (Activation)      (None, 15827)             0         
_________________________________________________________________
inter_out (BatchNormalizatio (None, 15827)             31654     
_________________________________________________________________
dense (Dense)                (None, 1)                 15828     
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 6,708,718
Trainable params: 6,677,064
Non-trainable params: 31,654
_________________________________________________________________
