Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputs_ (InputLayer)         [(None, 6986636)]         0         
_________________________________________________________________
reshape (Reshape)            (None, 6986636, 1)        0         
_________________________________________________________________
gene_layer (LocallyDirected1 (None, 15827, 1)          6661236   
_________________________________________________________________
activation (Activation)      (None, 15827, 1)          0         
_________________________________________________________________
inter_out0 (BatchNormalizati (None, 15827, 1)          2         
_________________________________________________________________
path1_layer (LocallyDirected (None, 337, 1)            23550     
_________________________________________________________________
activation_1 (Activation)    (None, 337, 1)            0         
_________________________________________________________________
inter_out1 (BatchNormalizati (None, 337, 1)            2         
_________________________________________________________________
path2_layer (LocallyDirected (None, 44, 1)             374       
_________________________________________________________________
activation_2 (Activation)    (None, 44, 1)             0         
_________________________________________________________________
inter_out2 (BatchNormalizati (None, 44, 1)             2         
_________________________________________________________________
path3_layer (LocallyDirected (None, 6, 1)              50        
_________________________________________________________________
activation_3 (Activation)    (None, 6, 1)              0         
_________________________________________________________________
inter_out3 (BatchNormalizati (None, 6, 1)              2         
_________________________________________________________________
flatten (Flatten)            (None, 6)                 0         
_________________________________________________________________
dense_layer (Dense)          (None, 1)                 7         
_________________________________________________________________
activation_4 (Activation)    (None, 1)                 0         
=================================================================
Total params: 6,685,225
Trainable params: 6,685,217
Non-trainable params: 8
_________________________________________________________________
