Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputs_ (InputLayer)         [(None, 6986636)]         0         
_________________________________________________________________
reshape (Reshape)            (None, 6986636, 1)        0         
_________________________________________________________________
gene_layer (LocallyDirected1 (None, 21476, 1)          6668279   
_________________________________________________________________
activation (Activation)      (None, 21476, 1)          0         
_________________________________________________________________
inter_out0 (BatchNormalizati (None, 21476, 1)          2         
_________________________________________________________________
gtex_layer (LocallyDirected1 (None, 292, 1)            316342    
_________________________________________________________________
activation_1 (Activation)    (None, 292, 1)            0         
_________________________________________________________________
inter_out1 (BatchNormalizati (None, 292, 1)            2         
_________________________________________________________________
flatten (Flatten)            (None, 292)               0         
_________________________________________________________________
dense_layer (Dense)          (None, 1)                 293       
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 6,984,918
Trainable params: 6,984,914
Non-trainable params: 4
_________________________________________________________________
